[
  {
    "name": "Pensiunea Sophia website",
    "imgPath": "img/projects/pensiunea_sophia.jpg",
    "codeLink": "https://github.com/razvanWebDev/pensiunea_sophia",
    "demoLink": "https://pensiuneasophiasalaj.ro/",
    "description": "I developed this website with an HTML template, incorporating a secure admin panel that mandates user login. The panel allows users to edit user profiles, photos, and blog sections, as well as check incoming messages from the contact form. It provides a convenient and protected interface for managing different aspects of the website.",
    "skillsUsed": "HTML, CSS, JavaScript, PHP, MySql."
  },
  {
    "name": "ARPIA website",
    "imgPath": "img/projects/ARPIA_website.jpg",
    "codeLink": "https://github.com/razvanWebDev/ARPIA_website",
    "demoLink": "https://www.arpia-filialacluj.ro/",
    "description": "Responsive website for A.R.P.I.A. in Cluj-Napoca. It showcases event listings, photo and video galleries, downloadable e-books, and a user-friendly contact form. The site engages visitors with captivating aviation history and promotes the association's initiatives, offering seamless interaction and a visually appealing experience.",
    "skillsUsed": "HTML, CSS, JavaScript, NodeJS, JSON, AJAX, PHP."
  },
  {
    "name": "Beauty Studio Website",
    "imgPath": "img/projects/beauty-studio.png",
    "codeLink": "https://github.com/razvanwebdev/beauty-studio-barnsley",
    "demoLink": "https://razvanwebdev.github.io/beauty-studio-barnsley/",
    "description": "Responsive website for a beauty studio. The landing page boasts compelling testimonials, while the price listings are organized into categories for easy navigation. The contact page features an embedded Google Map for precise location information and a user-friendly contact form, enhancing seamless communication with clients.",
    "skillsUsed": "HTML, CSS, JavaScript, JQuery, PHP, embeded Google Maps."
  },
  {
    "name": "Typing Test",
    "imgPath": "img/projects/typing-test.png",
    "codeLink": "https://github.com/razvanWebDev/Typing-test",
    "demoLink": "https://razvanwebdev.github.io/Typing-test/",
    "description": "Embark on an immersive typing speed test that allows you to evaluate your abilities with precision. Experience the thrill of challenging your typing skills and witness the remarkable results unfold before you. Upon completion, be rewarded with a meticulously personalized certificate, proudly displaying your name alongside a comprehensive summary of your achievements.",
    "skillsUsed": "HTML, CSS, JavaScript."
  },
  {
    "name": "Gym Member App",
    "imgPath": "img/projects/fitness-app.png",
    "codeLink": "https://github.com/razvanwebdev/node-fitness-members-app",
    "demoLink": "https://razvanwebdev.github.io/node-fitness-members-app/public/index.html",
    "description": "UI for Gym Member Subscription Management App with comprehensive CRUD operations. The app enables administrators with the ability to effortlessly handle subscription management, while providing members with editable features like contract extensions, session management, and member information updates.",
    "skillsUsed": "HTML, CSS, JavaScript, Express, NodeJS, JQuery, MySQL, phpMyAdmin, JSON, Gravatar."
  },
  {
    "name": "Rock Paper Scissors Lizzard Spock",
    "imgPath": "img/projects/rock-paper-scissors-lizzard-spock.png",
    "codeLink": "https://github.com/razvanwebdev/rock-paper-scissors-lizard-spock",
    "demoLink": "https://razvanwebdev.github.io/rock-paper-scissors-lizard-spock/index.html",
    "description": "Experience the enhanced Classic Rock Paper Scissors game, meticulously upgraded by the ingenious Sheldon Cooper from the beloved TV series 'The Big Bang Theory.' Engage in thrilling gameplay on the main page, while immersing yourself in Sheldon's expertly crafted rules page, where he personally displays and eloquently explains the game's intricacies",
    "skillsUsed": "HTML, CSS, JavaScript, JQuery, embeded Youtube video."
  }
]
